In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/011.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                   3                        4
0       NaN  NaN  NaN  Brown (R)  929,812  Thurmond (D)  1,127,182
1       NaN  NaN  NaN               45.2%                    54.8%
2    County   PR   TP                 NaN                      NaN
3   APPLING   19   19                1957                     1941
4  ATKINSON    6    6                 709                      702

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4
3   APPLING  19  19  1957  1941
4  ATKINSON   6   6   709   702
5     BACON   7   7  1000  1151
6     BAKER   7   7   306   634
7   BALDWIN  16  16  3525  6203

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4
3   APPLING  1957  1941
4  ATKINSON   709   702
5     BACON  1000  1151
6     BAKER   306   634
7   BALDWIN  3525  6203

In [9]:
df.columns = ['county', 'Brent Brown', 'Michael Thurmond']

In [10]:
df.tail(5)

        county Brent Brown Michael Thurmond
157  WHITFIELD        9177             6891
158     WILCOX         921              988
159     WILKES        1076             1554
160  WILKINSON         998             1733
161      WORTH        2354             2531

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county    candidate votes
0   APPLING  Brent Brown  1957
1  ATKINSON  Brent Brown   709
2     BACON  Brent Brown  1000
3     BAKER  Brent Brown   306
4   BALDWIN  Brent Brown  3525

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [16]:
df['office'] = 'Commissioner Of Labor'

In [17]:
df['district'] = ''

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Brent Brown', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Michael Thurmond', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Brent Brown       Republican     929812
Michael Thurmond  Democrat      1127182
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county                 office district       party    candidate  votes
0   APPLING  Commissioner Of Labor           Republican  Brent Brown   1957
1  ATKINSON  Commissioner Of Labor           Republican  Brent Brown    709
2     BACON  Commissioner Of Labor           Republican  Brent Brown   1000
3     BAKER  Commissioner Of Labor           Republican  Brent Brown    306
4   BALDWIN  Commissioner Of Labor           Republican  Brent Brown   3525

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')